РасширениеГТС/Джитиис/Documents/КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КорректировкаРеализации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидКорректировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаПоЗаказам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипКорректировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорректировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыЗапасовОприходование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидЗапасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоПоРНПТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СкладОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расхождения</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Enums/СпособыОпределенияСебестоимостиВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыОпределенияСебестоимостиВозврата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИзДокументаПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

РасширениеГТС/Джитиис/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютнаяОтгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютныйСчетВРубли</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/КорректировкаРеализации/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура асп_ОбработкаПроведения(Отказ, РежимПроведения)
	//ASP_Lebedev_000020332_17/08/2023 Принудительная регистрация в узле обмена.
	ДатаКонтроля = Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить();
	ОбъектМодифицирован = ASP_Добавленный.СравнитьВерсииОбъекта(ЭтотОбъект); //000026792
	Если НЕ Отказ и ЭтотОбъект.Проведен и ЭтотОбъект.Дата > ДатаКонтроля и ОбъектМодифицирован Тогда         
		узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.НайтиПоКоду("002");
		ПланыОбмена.ЗарегистрироватьИзменения(узел, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
&Вместо("ВременныеТаблицыДанныхДокументаОприходование")
Функция ASP_ВременныеТаблицыДанныхДокументаОприходование(МассивВариантовОтражения, ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5);
		
		//+ASP Ямаева 11.01.2022
		
		Запрос = Новый Запрос;
		//Запрос.УстановитьПараметр("Расхождения", Ссылка.Расхождения.Выгрузить());
		Запрос.УстановитьПараметр("Расхождения", Расхождения.Выгрузить());
		Запрос.УстановитьПараметр("ДокументОснование", Ссылка.ДокументОснование);
		
		Запрос.Текст ="ВЫБРАТЬ
		              |	КорректировкаРеализацииРасхождения.Номенклатура КАК Номенклатура,
		              |	КорректировкаРеализацииРасхождения.Характеристика КАК Характеристика,
		              |	КорректировкаРеализацииРасхождения.Назначение КАК Назначение,
		              |	КорректировкаРеализацииРасхождения.Содержание КАК Содержание,
		              |	КорректировкаРеализацииРасхождения.Упаковка КАК Упаковка,
		              |	КорректировкаРеализацииРасхождения.КоличествоУпаковок КАК КоличествоУпаковок,
		              |	КорректировкаРеализацииРасхождения.Количество КАК Количество,
		              |	КорректировкаРеализацииРасхождения.Сумма КАК Сумма,
		              |	КорректировкаРеализацииРасхождения.СтавкаНДС КАК СтавкаНДС,
		              |	КорректировкаРеализацииРасхождения.СуммаНДС КАК СуммаНДС,
		              |	КорректировкаРеализацииРасхождения.СуммаСНДС КАК СуммаСНДС,
		              |	КорректировкаРеализацииРасхождения.ЗаказКлиента КАК ЗаказКлиента,
		              |	КорректировкаРеализацииРасхождения.КодСтроки КАК КодСтроки,
		              |	КорректировкаРеализацииРасхождения.Склад КАК Склад,
		              |	КорректировкаРеализацииРасхождения.ВариантОтражения КАК ВариантОтражения,
		              |	КорректировкаРеализацииРасхождения.ИдентификаторСтроки КАК ИдентификаторСтроки,
		              |	КорректировкаРеализацииРасхождения.Серия КАК Серия,
		              |	КорректировкаРеализацииРасхождения.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		              |	КорректировкаРеализацииРасхождения.СтатусУказанияСерий КАК СтатусУказанияСерий,
		              |	КорректировкаРеализацииРасхождения.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		              |	КорректировкаРеализацииРасхождения.НоменклатураНабора КАК НоменклатураНабора,
		              |	КорректировкаРеализацииРасхождения.ХарактеристикаНабора КАК ХарактеристикаНабора,
		              |	КорректировкаРеализацииРасхождения.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
		              |	КорректировкаРеализацииРасхождения.СтатьяДоходов КАК СтатьяДоходов,
		              |	КорректировкаРеализацииРасхождения.АналитикаДоходов КАК АналитикаДоходов,
		              |	КорректировкаРеализацииРасхождения.КодТНВЭД КАК КодТНВЭД
		              |ПОМЕСТИТЬ ВТРасхождения
		              |ИЗ
		              |	&Расхождения КАК КорректировкаРеализацииРасхождения
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
					  //ASP Mike 000028341 10//11//2025 - сделана группировка видов запасов реализации
					  |ВЫБРАТЬ
					  |	РеализацияТоваровУслугВидыЗапасов.Ссылка КАК Ссылка,
					  |	РеализацияТоваровУслугВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
					  |	РеализацияТоваровУслугВидыЗапасов.НомерГТД КАК НомерГТД,
					  |	РеализацияТоваровУслугВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
					  |	СУММА(РеализацияТоваровУслугВидыЗапасов.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
					  |	РеализацияТоваровУслугВидыЗапасов.ЗаказКлиента КАК ЗаказКлиента,
					  |	РеализацияТоваровУслугВидыЗапасов.КодТНВЭД КАК КодТНВЭД,
					  |	СУММА(РеализацияТоваровУслугВидыЗапасов.Количество) КАК Количество,
					  |	СУММА(РеализацияТоваровУслугВидыЗапасов.СуммаСНДС) КАК СуммаСНДС,
					  |	СУММА(РеализацияТоваровУслугВидыЗапасов.СуммаНДС) КАК СуммаНДС,
					  |	РеализацияТоваровУслугВидыЗапасов.ОбъектРасчетов КАК ОбъектРасчетов,
					  |	РеализацияТоваровУслугВидыЗапасов.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов
					  |ПОМЕСТИТЬ ВТВидыЗапасовРеализация
					  |ИЗ
					  |	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК РеализацияТоваровУслугВидыЗапасов
		              |ГДЕ
		              |	РеализацияТоваровУслугВидыЗапасов.Ссылка = &ДокументОснование
					  |
					  |СГРУППИРОВАТЬ ПО
					  |	РеализацияТоваровУслугВидыЗапасов.НомерГТД,
					  |	РеализацияТоваровУслугВидыЗапасов.КодТНВЭД,
					  |	РеализацияТоваровУслугВидыЗапасов.ОбъектРасчетов,
					  |	РеализацияТоваровУслугВидыЗапасов.ЗаказКлиента,
					  |	РеализацияТоваровУслугВидыЗапасов.ВидЗапасов,
					  |	РеализацияТоваровУслугВидыЗапасов.АналитикаУчетаНоменклатуры,
					  |	РеализацияТоваровУслугВидыЗапасов.АналитикаУчетаНаборов,
					  |	РеализацияТоваровУслугВидыЗапасов.Ссылка
					  |
					  |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ
		              |	-ВТРасхождения.СуммаНДС КАК СуммаНДС,
		              |	-ВТРасхождения.СуммаСНДС КАК СуммаСНДС,
		              |	ЕСТЬNULL(-ВТРасхождения.Количество, 0) КАК Количество,
		              |	ВТРасхождения.ЗаказКлиента КАК ЗаказКлиента,
		              |	ВТРасхождения.Склад КАК Склад,
		              |	ВТРасхождения.Склад КАК СкладОтгрузки,
		              |	ВТРасхождения.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		              |	РеализацияТоваровУслугВидыЗапасов.НомерГТД КАК НомерГТД,
		              |	РеализацияТоваровУслугВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
		              |	ЕСТЬNULL(РеализацияТоваровУслугВидыЗапасов.КоличествоПоРНПТ, 0) КАК КоличествоПоРНПТ,
		              |	РеализацияТоваровУслугВидыЗапасов.ЗаказКлиента КАК ЗаказКлиента1,
		              |	РеализацияТоваровУслугВидыЗапасов.КодТНВЭД КАК КодТНВЭД,
		              |	ЕСТЬNULL(РеализацияТоваровУслугВидыЗапасов.Количество, 0) КАК КоличествоРеализации,
		              |	ВТРасхождения.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
		              |	ЕСТЬNULL(РеализацияТоваровУслугВидыЗапасов.СуммаСНДС, 0) КАК СуммаСНДС1,
		              |	ЕСТЬNULL(РеализацияТоваровУслугВидыЗапасов.СуммаНДС, 0) КАК СуммаНДС1,
		              |	ВТРасхождения.СтавкаНДС КАК СтавкаНДС,
		              |	РеализацияТоваровУслугВидыЗапасов.ОбъектРасчетов КАК ОбъектРасчетов
		              |ИЗ
		              |	ВТРасхождения КАК ВТРасхождения
		              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыЗапасовРеализация КАК РеализацияТоваровУслугВидыЗапасов
		              |		ПО ВТРасхождения.Номенклатура = РеализацияТоваровУслугВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура
		              |			И (&ДокументОснование = РеализацияТоваровУслугВидыЗапасов.Ссылка) 
					  // 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
		              |			И (РеализацияТоваровУслугВидыЗапасов.АналитикаУчетаНаборов = ВТРасхождения.АналитикаУчетаНаборов)";
		
		ТаблицаРасхождений = Запрос.Выполнить().Выгрузить();
		Если ВидыЗапасовОприходование.Количество()=0 Тогда	
			Для Каждого ДанныеРасхождения Из ТаблицаРасхождений Цикл
				НовоеРасхождение = ВидыЗапасовОприходование.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеРасхождение, ДанныеРасхождения);
				НовоеРасхождение.КоличествоПоРНПТ=МИН(ДанныеРасхождения.Количество,ДанныеРасхождения.КоличествоПоРНПТ);
				НовоеРасхождение.КоличествоУпаковок= МИН(ДанныеРасхождения.Количество, ДанныеРасхождения.КоличествоРеализации);
				НовоеРасхождение.Количество = МИН(ДанныеРасхождения.Количество, ДанныеРасхождения.КоличествоРеализации);
				НовоеРасхождение.ВидЗапасовОтгрузки=ДанныеРасхождения.ВидЗапасов;  
				НовоеРасхождение.СуммаНДС = Мин(ДанныеРасхождения.СуммаНДС, ДанныеРасхождения.СуммаНДС1);
				НовоеРасхождение.СуммаСНДС = Мин(ДанныеРасхождения.СуммаСНДС, ДанныеРасхождения.СуммаСНДС1);
				
			КонецЦикла;
		КонецЕсли;
		//-ASP Ямаева 11.01.2022
			
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&Дата														КАК Дата,
		|	&Организация												КАК Организация,
		|	&Склад														КАК Склад,
		|	&Партнер													КАК Партнер,
		|	&Контрагент													КАК Контрагент,
		|	ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)	КАК Соглашение,
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)		КАК Договор,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)					КАК Валюта,
		|	&НалогообложениеНДС											КАК НалогообложениеНДС,
		|	&ХозяйственнаяОперация										КАК ХозяйственнаяОперация,
		|	ЛОЖЬ														КАК ЕстьСделкиВТабличнойЧасти,
		|	&ДеятельностьОблагаетсяЕНВД									КАК ДеятельностьОблагаетсяЕНВД,
		|	ВЫБОР
		|		КОГДА СтруктураПредприятия.ВариантОбособленногоУчетаТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоПодразделению)
		|				И &ФормироватьВидыЗапасовПоПодразделениямМенеджерам
		|			ТОГДА &Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ														КАК Подразделение,
		|	ВЫБОР
		|		КОГДА СтруктураПредприятия.ВариантОбособленногоУчетаТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоМенеджерамПодразделения)
		|				И &ФормироватьВидыЗапасовПоПодразделениямМенеджерам
		|			ТОГДА &Менеджер
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	КОНЕЦ														КАК Менеджер,
		|	ВЫБОР
		|		КОГДА СделкиСКлиентами.ОбособленныйУчетТоваровПоСделке
		|				И &ФормироватьВидыЗапасовПоСделкам
		|			ТОГДА &Сделка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
		|	КОНЕЦ														КАК Сделка,
		|	&ДокументРеализации											КАК ДокументРеализации,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)					КАК ТипЗапасов
		|ПОМЕСТИТЬ ТаблицаДанныхДокумента
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ПО СтруктураПредприятия.Ссылка = &Подразделение
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СделкиСКлиентами КАК СделкиСКлиентами
		|		ПО СделкиСКлиентами.Ссылка = &Сделка
		|
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки												КАК НомерСтроки,
		|	ТаблицаТоваров.ВариантОтражения											КАК ВариантОтражения,
		|	ТаблицаТоваров.Номенклатура												КАК Номенклатура,
		|	ТаблицаТоваров.Характеристика											КАК Характеристика,
		|	ТаблицаТоваров.Серия													КАК Серия,
		|	ТаблицаТоваров.СтатусУказанияСерий										КАК СтатусУказанияСерий,
		|	ТаблицаТоваров.АналитикаУчетаНоменклатуры								КАК ОсновнаяАналитика,
		|	ВЫБОР
		|		КОГДА &ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5
		|				И ТаблицаТоваров.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА ТаблицаТоваров.КорАналитикаУчетаНоменклатуры
		|		ИНАЧЕ ТаблицаТоваров.АналитикаУчетаНоменклатуры
		|	КОНЕЦ																	КАК АналитикаУчетаНоменклатуры,
		|	-ТаблицаТоваров.Количество												КАК Количество,
		|	ТаблицаТоваров.Склад													КАК Склад,
		|	&ДокументРеализации														КАК ДокументРеализации,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи) КАК СпособОпределенияСебестоимости,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)КАК АналитикаУчетаНоменклатурыОтгрузки,
		|	ТаблицаТоваров.ЗаказКлиента												КАК ЗаказКлиента,
		|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)						КАК Сделка,
		|	ТаблицаТоваров.Назначение												КАК Назначение,
		|	ТаблицаТоваров.КодТНВЭД													КАК КодТНВЭД,
		|	ТаблицаТоваров.СтавкаНДС												КАК СтавкаНДС,
		|	-(ТаблицаТоваров.Сумма + (ТаблицаТоваров.СуммаНДС * &ЦенаВключаетНДС))	КАК СуммаСНДС,
		|	-ТаблицаТоваров.СуммаНДС												КАК СуммаНДС,
		|	0																		КАК СуммаВознаграждения,
		|	0																		КАК СуммаНДСВознаграждения,
		|	ЛОЖЬ																	ПодбиратьВидыЗапасов,
		|	ТаблицаТоваров.Себестоимость											КАК Себестоимость,
		|	ТаблицаТоваров.СебестоимостьБезНДС										КАК СебестоимостьБезНДС,
		|	ТаблицаТоваров.СебестоимостьРегл										КАК СебестоимостьРегл,
		|	ТаблицаТоваров.СебестоимостьПР											КАК СебестоимостьПР,
		|	ТаблицаТоваров.СебестоимостьВР											КАК СебестоимостьВР,
		|	ТаблицаТоваров.КодСтроки												КАК КодСтроки,
		|	ТаблицаТоваров.ОбъектРасчетов											КАК ОбъектРасчетов,
		|	ВЫБОР
		|		КОГДА &ТипКорректировки = ЗНАЧЕНИЕ(Перечисление.ТипыКорректировки.ОбычнаяКорректировка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаТоваров.НомерГТД
		|	КОНЕЦ																	КАК НомерГТД,
		|
		|	ТаблицаТоваров.СтатьяРасходов КАК СтатьяРасходов,
		|	ТаблицаТоваров.АналитикаРасходов КАК АналитикаРасходов,
		|	ТаблицаТоваров.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
		|	ТаблицаТоваров.СписатьНаРасходы КАК СписатьНаРасходы,
		|	ТаблицаТоваров.НоменклатураНабора КАК НоменклатураНабора
		|ПОМЕСТИТЬ ВтТаблицаТоваров
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|
		|ГДЕ
		|	ТаблицаТоваров.ВариантОтражения В(&МассивВариантовОтражения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки		КАК НомерСтроки,
		|	ТоварыЗаказа.Ссылка.Назначение	КАК Назначение
		|ПОМЕСТИТЬ ВтТоварыПодЗаказ
		|ИЗ
		|	ВтТаблицаТоваров КАК ТаблицаТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ТоварыЗаказа
		|		ПО ТаблицаТоваров.ЗаказКлиента = ТоварыЗаказа.Ссылка
		|			И ТаблицаТоваров.КодСтроки = ТоварыЗаказа.КодСтроки
		|			И ТаблицаТоваров.Номенклатура = ТоварыЗаказа.Номенклатура
		|			И ТаблицаТоваров.Характеристика = ТоварыЗаказа.Характеристика
		|
		|ГДЕ
		|	&ПродажаПоЗаказам
		|	И ТаблицаТоваров.ЗаказКлиента <> Неопределено
		|	И ТоварыЗаказа.Обособленно
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки		КАК НомерСтроки,
		|	ТоварыЗаказа.Ссылка.Назначение	КАК Назначение
		|ИЗ
		|	ВтТаблицаТоваров КАК ТаблицаТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТоварыЗаказа
		|		ПО ТаблицаТоваров.ЗаказКлиента = ТоварыЗаказа.Ссылка
		|			И ТаблицаТоваров.КодСтроки = ТоварыЗаказа.КодСтроки
		|			И ТаблицаТоваров.Номенклатура = ТоварыЗаказа.Номенклатура
		|			И ТаблицаТоваров.Характеристика = ТоварыЗаказа.Характеристика
		|
		|ГДЕ
		|	&ПродажаПоЗаказам
		|	И ТаблицаТоваров.ЗаказКлиента <> Неопределено
		|	И ТоварыЗаказа.Обособленно
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСтроки
		|;
		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ASP_ТаблицаВидыЗапасов.НомерСтроки						КАК НомерСтроки,
		|	ASP_ТаблицаВидыЗапасов.НаДоходыРасходы					КАК НаДоходыРасходы,
		|	ASP_ТаблицаВидыЗапасов.Номенклатура		КАК Номенклатура,
		|	ASP_ТаблицаВидыЗапасов.ВидЗапасов						КАК ВидЗапасов,
		|	ASP_ТаблицаВидыЗапасов.НомерГТД							КАК НомерГТД,
		|	ASP_ТаблицаВидыЗапасов.КодТНВЭД							КАК КодТНВЭД,
		|	ASP_ТаблицаВидыЗапасов.СтавкаНДС						КАК СтавкаНДС,
		|	ASP_ТаблицаВидыЗапасов.СкладОтгрузки					КАК СкладОтгрузки,
		|	ASP_ТаблицаВидыЗапасов.Склад							КАК Склад,
		|	ASP_ТаблицаВидыЗапасов.ЗаказКлиента						КАК ЗаказКлиента,
		|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)	КАК Сделка,
		|	ASP_ТаблицаВидыЗапасов.Количество						КАК Количество,
		|	ВЫБОР
		|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
		|				ИЛИ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
		|			ТОГДА 0
		|		ИНАЧЕ ASP_ТаблицаВидыЗапасов.КоличествоПоРНПТ
		|	КОНЕЦ										    	КАК КоличествоПоРНПТ,
		|	ASP_ТаблицаВидыЗапасов.СуммаСНДС						КАК СуммаСНДС,
		|	ASP_ТаблицаВидыЗапасов.СуммаНДС							КАК СуммаНДС,
		|	ЛОЖЬ												КАК ВидыЗапасовУказаныВручную,
		|	ASP_ТаблицаВидыЗапасов.НоменклатураНабора КАК НоменклатураНабора
		|ПОМЕСТИТЬ ASP_ВтВидыЗапасов
		|ИЗ
		|	&ТаблицаВидыЗапасов КАК ASP_ТаблицаВидыЗапасов
		|;
		
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки					 КАК НомерСтроки,
		|	ТаблицаТоваров.ВариантОтражения				 КАК ВариантОтражения,
		|	ТаблицаТоваров.Номенклатура					 КАК Номенклатура,
		|	ТаблицаТоваров.Характеристика				 КАК Характеристика,
		|	ТаблицаТоваров.Назначение				 	 КАК Назначение,
		|	ТаблицаТоваров.Серия				         КАК Серия,
		|	ТаблицаТоваров.СтатусУказанияСерий			 КАК СтатусУказанияСерий,
		|	ТаблицаТоваров.ОсновнаяАналитика			 КАК ОсновнаяАналитика,
		|	ТаблицаТоваров.АналитикаУчетаНоменклатуры	 КАК АналитикаУчетаНоменклатуры,
		|	ТаблицаТоваров.Количество					 КАК Количество,
		|	ТаблицаТоваров.Склад						 КАК Склад,
		|	ТаблицаТоваров.ДокументРеализации			 КАК ДокументРеализации,
		|	ТаблицаТоваров.СпособОпределенияСебестоимости КАК СпособОпределенияСебестоимости,
		|	ТаблицаТоваров.ОбъектРасчетов				 КАК ОбъектРасчетов,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)КАК АналитикаУчетаНоменклатурыОтгрузки,
		|	ТаблицаТоваров.ЗаказКлиента					 КАК ЗаказКлиента,
		|	ТаблицаТоваров.КодТНВЭД						 КАК КодТНВЭД,
		|	ТаблицаТоваров.СтавкаНДС					 КАК СтавкаНДС,
		|	ТаблицаТоваров.СуммаСНДС					 КАК СуммаСНДС,
		|	ТаблицаТоваров.СуммаНДС						 КАК СуммаНДС,
		|	0											 КАК СуммаВознаграждения,
		|	0											 КАК СуммаНДСВознаграждения,
		|	ТаблицаТоваров.Сделка						 КАК Сделка,
		|	ТаблицаТоваров.ПодбиратьВидыЗапасов			 КАК ПодбиратьВидыЗапасов,
		|	ASP_ВтВидыЗапасов.НомерГТД	 КАК НомерГТД,
		|	ASP_ВтВидыЗапасов.КоличествоПоРНПТ	 КАК КоличествоПоРНПТ,
		|	ТаблицаТоваров.Себестоимость				 КАК Себестоимость,
		|	ТаблицаТоваров.СебестоимостьБезНДС			 КАК СебестоимостьБезНДС,
		|	ТаблицаТоваров.СебестоимостьРегл			 КАК СебестоимостьРегл,
		|	ТаблицаТоваров.СебестоимостьПР				 КАК СебестоимостьПР,
		|	ТаблицаТоваров.СебестоимостьВР				 КАК СебестоимостьВР,
		|	ТаблицаТоваров.СтатьяРасходов				 КАК СтатьяРасходов,
		|	ТаблицаТоваров.АналитикаРасходов			 КАК АналитикаРасходов,
		|	ТаблицаТоваров.АналитикаАктивовПассивов		 КАК АналитикаАктивовПассивов,
		|	ТаблицаТоваров.СписатьНаРасходы				 КАК СписатьНаРасходы,
		// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
		|	ТаблицаТоваров.НоменклатураНабора 			 КАК НоменклатураНабора
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	ВтТаблицаТоваров КАК ТаблицаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыПодЗаказ КАК ТоварыПодЗаказ
		|		ПО ТаблицаТоваров.НомерСтроки = ТоварыПодЗаказ.НомерСтроки
		|		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ТаблицаТоваров.Номенклатура = СправочникНоменклатура.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ASP_ВтВидыЗапасов КАК ASP_ВтВидыЗапасов
		|		ПО ТаблицаТоваров.Номенклатура = ASP_ВтВидыЗапасов.Номенклатура
		|			И ТаблицаТоваров.НоменклатураНабора = ASP_ВтВидыЗапасов.НоменклатураНабора
		|
		|ГДЕ
		|	СправочникНоменклатура.ТипНоменклатуры В(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|											ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВидыЗапасов.НомерСтроки						КАК НомерСтроки,
		|	ТаблицаВидыЗапасов.НаДоходыРасходы					КАК НаДоходыРасходы,
		|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
		|	ТаблицаВидыЗапасов.ВидЗапасов						КАК ВидЗапасов,
		|	ТаблицаВидыЗапасов.НомерГТД							КАК НомерГТД,
		|	ТаблицаВидыЗапасов.КодТНВЭД							КАК КодТНВЭД,
		|	ТаблицаВидыЗапасов.СтавкаНДС						КАК СтавкаНДС,
		|	ТаблицаВидыЗапасов.СкладОтгрузки					КАК СкладОтгрузки, 	
		|	ТаблицаВидыЗапасов.ОбъектРасчетов					КАК ОбъектРасчетов,
		|	ТаблицаВидыЗапасов.Склад							КАК Склад,
		|	ТаблицаВидыЗапасов.ЗаказКлиента						КАК ЗаказКлиента,
		|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)	КАК Сделка,
		|	ТаблицаВидыЗапасов.Количество						КАК Количество,
		|	ВЫБОР
		|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
		|				ИЛИ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
		|			ТОГДА 0
		|		ИНАЧЕ ТаблицаВидыЗапасов.КоличествоПоРНПТ
		|	КОНЕЦ										    	КАК КоличествоПоРНПТ,
		|	ТаблицаВидыЗапасов.СуммаСНДС						КАК СуммаСНДС,
		|	ТаблицаВидыЗапасов.СуммаНДС							КАК СуммаНДС,
		|	ЛОЖЬ												КАК ВидыЗапасовУказаныВручную,
		|	ТаблицаВидыЗапасов.Себестоимость					КАК Себестоимость,
		|	ТаблицаВидыЗапасов.СебестоимостьБезНДС				КАК СебестоимостьБезНДС,
		|	ТаблицаВидыЗапасов.СебестоимостьРегл				КАК СебестоимостьРегл,
		|	ТаблицаВидыЗапасов.СебестоимостьПР					КАК СебестоимостьПР,
		|	ТаблицаВидыЗапасов.СебестоимостьВР					КАК СебестоимостьВР,
		|	ТаблицаВидыЗапасов.СпособОпределенияСебестоимости	КАК СпособОпределенияСебестоимости,
		|
		|	ТаблицаВидыЗапасов.СтатьяРасходов КАК СтатьяРасходов,
		|	ТаблицаВидыЗапасов.АналитикаРасходов КАК АналитикаРасходов,
		|	ТаблицаВидыЗапасов.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
		|	ТаблицаВидыЗапасов.СписатьНаРасходы КАК СписатьНаРасходы,  
		// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
		|	isnull(ТаблицаВидыЗапасов.НоменклатураНабора, Истина) Как НоменклатураНабора

		|ПОМЕСТИТЬ ВтВидыЗапасов
		|ИЗ
		|	&ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВидыЗапасов.НомерСтроки						КАК НомерСтроки,
		|	ТаблицаВидыЗапасов.НаДоходыРасходы					КАК НаДоходыРасходы,
		|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
		|	Аналитика.Номенклатура								КАК Номенклатура,
		|	Аналитика.Характеристика							КАК Характеристика,
		|	Аналитика.Серия										КАК Серия,
		|	ТаблицаВидыЗапасов.ВидЗапасов						КАК ВидЗапасов,
		|	НЕОПРЕДЕЛЕНО 										КАК ВидЗапасовПолучателя,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)КАК АналитикаУчетаНоменклатурыОтгрузки,
		|	&ДокументРеализации									КАК ДокументРеализации,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи) КАК СпособОпределенияСебестоимости,
		|	ТаблицаВидыЗапасов.НомерГТД							КАК НомерГТД,
		|	ТаблицаВидыЗапасов.КодТНВЭД							КАК КодТНВЭД,
		|	ТаблицаВидыЗапасов.СтавкаНДС						КАК СтавкаНДС,
		|	ТаблицаВидыЗапасов.ОбъектРасчетов					КАК ОбъектРасчетов,
		|	ТаблицаВидыЗапасов.СкладОтгрузки					КАК СкладОтгрузки,
		|	ТаблицаВидыЗапасов.Склад							КАК Склад,
		|	ТаблицаВидыЗапасов.ЗаказКлиента						КАК ЗаказКлиента,
		|	ТаблицаВидыЗапасов.Сделка							КАК Сделка,
		|	ТаблицаВидыЗапасов.Количество						КАК Количество,
		|	ТаблицаВидыЗапасов.КоличествоПоРНПТ					КАК КоличествоПоРНПТ,
		|	ТаблицаВидыЗапасов.СуммаСНДС						КАК СуммаСНДС,
		|	ТаблицаВидыЗапасов.СуммаНДС							КАК СуммаНДС,
		|	ТаблицаВидыЗапасов.ВидыЗапасовУказаныВручную		КАК ВидыЗапасовУказаныВручную,
		|	ТаблицаВидыЗапасов.Себестоимость					КАК Себестоимость,
		|	ТаблицаВидыЗапасов.СебестоимостьБезНДС				КАК СебестоимостьБезНДС,
		|	ТаблицаВидыЗапасов.СебестоимостьРегл				КАК СебестоимостьРегл,
		|	ТаблицаВидыЗапасов.СебестоимостьПР					КАК СебестоимостьПР,
		|	ТаблицаВидыЗапасов.СебестоимостьВР					КАК СебестоимостьВР,    
		// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
		|	isnull(ТаблицаВидыЗапасов.НоменклатураНабора, Истина) Как НоменклатураНабора,
		|	ТаблицаВидыЗапасов.СтатьяРасходов КАК СтатьяРасходов,
		|	ТаблицаВидыЗапасов.АналитикаРасходов КАК АналитикаРасходов,
		|	ТаблицаВидыЗапасов.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
		|	ТаблицаВидыЗапасов.СписатьНаРасходы КАК СписатьНаРасходы
		|ПОМЕСТИТЬ ТаблицаВидыЗапасов
		|ИЗ
		|	ВтВидыЗапасов КАК ТаблицаВидыЗапасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ПО ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры,
		|	Аналитика.Номенклатура,
		|	Аналитика.Характеристика,
		|	Аналитика.Серия
		|";
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		ASP_ВидыЗапасовОприходование = ВидыЗапасовОприходование.Выгрузить();
		ASP_ВидыЗапасовОприходование.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ASP_ВидыЗапасовОприходование.Колонки.Добавить("НоменклатураНабора",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Для каждого СтрокаТовара Из ASP_ВидыЗапасовОприходование Цикл
			СтрокаТовара.Номенклатура = СтрокаТовара.АналитикаУчетаНоменклатуры.Номенклатура;
			СтрокаТовара.НоменклатураНабора = СтрокаТовара.АналитикаУчетаНаборов.НоменклатураНабора;
		КонецЦикла;
			
		Запрос.УстановитьПараметр("Ссылка",								Ссылка);
		Запрос.УстановитьПараметр("Дата",								Дата);
		Запрос.УстановитьПараметр("Организация",						Организация);
		Запрос.УстановитьПараметр("Партнер",							Партнер);
		Запрос.УстановитьПараметр("Контрагент",							Контрагент);
		Запрос.УстановитьПараметр("Менеджер",							Менеджер);
		Запрос.УстановитьПараметр("Подразделение",						Подразделение);
		Запрос.УстановитьПараметр("Сделка",								Сделка);
		Запрос.УстановитьПараметр("Склад",								Склад);
		Запрос.УстановитьПараметр("НалогообложениеНДС",					НалогообложениеНДС);
		Запрос.УстановитьПараметр("ЦенаВключаетНДС",					?(ЦенаВключаетНДС, 0, 1));
		Запрос.УстановитьПараметр("ХозяйственнаяОперация",				ВидКорректировки);
		Запрос.УстановитьПараметр("ДеятельностьОблагаетсяЕНВД",			(НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД));
		Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоПодразделениямМенеджерам", ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоПодразделениямМенеджерам"));
		Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоСделкам",	ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоСделкам"));
		Запрос.УстановитьПараметр("ТаблицаТоваров",						Расхождения);
		Запрос.УстановитьПараметр("ТаблицаВидыЗапасов",					ASP_ВидыЗапасовОприходование);
		Запрос.УстановитьПараметр("МассивВариантовОтражения",			МассивВариантовОтражения);
		Запрос.УстановитьПараметр("ДокументРеализации",					ДокументОснование);
		Запрос.УстановитьПараметр("ПродажаПоЗаказам",					ПродажаПоЗаказам);
		Запрос.УстановитьПараметр("ТипКорректировки",					ТипКорректировки);
		Запрос.УстановитьПараметр("ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5", ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5);
		УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
		
		ЗапасыСервер.ДополнитьВременныеТаблицыОбязательнымиКолонками(Запрос);
		
		Запрос.Выполнить();
		
		Возврат МенеджерВременныхТаблиц;
			
КонецФункции
#КонецЕсли
